; domain
(define (domain Rover)
  (:requirements :typing)
  (:types rover waypoint store camera mode lander objective)

  (:predicates (at ?x - rover ?y - waypoint) 
               (at_lander ?x - lander ?y - waypoint)
               (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
               (equipped_for_soil_analysis ?r - rover)
               (equipped_for_rock_analysis ?r - rover)
               (equipped_for_imaging ?r - rover)
               (empty ?s - store)
               (have_rock_analysis ?r - rover ?w - waypoint)
               (have_soil_analysis ?r - rover ?w - waypoint)
               (full ?s - store)
               (calibrated ?c - camera ?r - rover) 
               (supports ?c - camera ?m - mode)
               (available ?r - rover)
               (visible ?w - waypoint ?p - waypoint)
               (have_image ?r - rover ?o - objective ?m - mode)
               (communicated_soil_data ?w - waypoint)
               (communicated_rock_data ?w - waypoint)
               (communicated_image_data ?o - objective ?m - mode)
               (at_soil_sample ?w - waypoint)
               (at_rock_sample ?w - waypoint)
               (visible_from ?o - objective ?w - waypoint)
               (store_of ?s - store ?r - rover)
               (calibration_target ?i - camera ?o - objective)
               (on_board ?i - camera ?r - rover)
               (channel_free ?l - lander))
  
  ;; 移動
  (:action navigate
           :parameters (?x - rover ?y - waypoint ?z - waypoint) 
           :precondition (and (can_traverse ?x ?y ?z)
                              (available ?x)
                              (at ?x ?y) 
                              (visible ?y ?z))
           :effect (and (not (at ?x ?y))
                        (at ?x ?z)))

  ;; 土をカゴに入れる
  (:action sample_soil
           :parameters (?x - rover ?s - store ?p - waypoint)
           :precondition (and (at ?x ?p)
                              (at_soil_sample ?p)
                              (equipped_for_soil_analysis ?x)
                              (store_of ?s ?x)
                              (empty ?s))
           :effect (and (not (empty ?s))
                        (full ?s)
                        (have_soil_analysis ?x ?p)
                        (not (at_soil_sample ?p))))

  ;; 石をカゴに入れる 内容は土と同じ
  (:action sample_rock
           :parameters (?x - rover ?s - store ?p - waypoint)
           :precondition (and (at ?x ?p)
                              (at_rock_sample ?p)
                              (equipped_for_rock_analysis ?x)
                              (store_of ?s ?x)
                              (empty ?s))
           :effect (and (not (empty ?s))
                        (full ?s)
                        (have_rock_analysis ?x ?p)
                        (not (at_rock_sample ?p))))

  ;; かごの中身を捨てる
  (:action drop
           :parameters (?x - rover ?y - store)
           :precondition (and (store_of ?y ?x)
                              (full ?y))
           :effect (and (not (full ?y)) (empty ?y)))

  ;; カメラの焦点を合わせる
  (:action calibrate
           :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
           :precondition (and (equipped_for_imaging ?r)
                              (calibration_target ?i ?t)
                              (at ?r ?w)
                              (visible_from ?t ?w)
                              (on_board ?i ?r))
           :effect (calibrated ?i ?r))

  ;; 写真を取る
  (:action take_image
           :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
           :precondition (and (calibrated ?i ?r)
                              (on_board ?i ?r)
                              (equipped_for_imaging ?r)
                              (supports ?i ?m)
                              (visible_from ?o ?p)
                              (at ?r ?p))
           :effect (and (have_image ?r ?o ?m)
                        (not (calibrated ?i ?r))))

  ;; データを送信
  (:action communicate_soil_data
           :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_soil_analysis ?r ?p)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_soil_data ?p)))

  (:action communicate_rock_data
           :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_rock_analysis ?r ?p)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_rock_data ?p)))

  (:action communicate_image_data
           :parameters (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_image ?r ?o ?m)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_image_data ?o ?m)))

  (:action end_communication
           :parameters (?r - rover ?l - lander ?m - mode ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (visible ?x ?y))
           :effect (and (channel_free ?l)
                        (available ?r))))

; problem
(define (problem roverprob06) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 - Waypoint
	camera0 camera1 camera2 - Camera
	objective0 objective1 - Objective
	)
(:init
	(visible waypoint0 waypoint3)
	(visible waypoint3 waypoint0)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint4)
	(visible waypoint4 waypoint1)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint2)
	(visible waypoint3 waypoint1)
	(visible waypoint1 waypoint3)
	(visible waypoint3 waypoint5)
	(visible waypoint5 waypoint3)
	(visible waypoint4 waypoint3)
	(visible waypoint3 waypoint4)
	(visible waypoint5 waypoint0)
	(visible waypoint0 waypoint5)
	(visible waypoint5 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint5)
	(at_rock_sample waypoint0)
	(at_soil_sample waypoint1)
	(at_soil_sample waypoint2)
	(at_rock_sample waypoint2)
	(at_soil_sample waypoint3)
	(at_rock_sample waypoint3)
	(at_soil_sample waypoint4)
	(at_soil_sample waypoint5)
	(at_rock_sample waypoint5)
	(at_lander general waypoint3)
	(channel_free general)
	(at rover0 waypoint1)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_rock_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint1 waypoint0)
	(can_traverse rover0 waypoint0 waypoint1)
	(can_traverse rover0 waypoint1 waypoint4)
	(can_traverse rover0 waypoint4 waypoint1)
	(can_traverse rover0 waypoint0 waypoint2)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint3)
	(can_traverse rover0 waypoint3 waypoint0)
	(can_traverse rover0 waypoint0 waypoint5)
	(can_traverse rover0 waypoint5 waypoint0)
	(at rover1 waypoint4)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_soil_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint4 waypoint1)
	(can_traverse rover1 waypoint1 waypoint4)
	(can_traverse rover1 waypoint4 waypoint3)
	(can_traverse rover1 waypoint3 waypoint4)
	(can_traverse rover1 waypoint4 waypoint5)
	(can_traverse rover1 waypoint5 waypoint4)
	(can_traverse rover1 waypoint1 waypoint0)
	(can_traverse rover1 waypoint0 waypoint1)
	(can_traverse rover1 waypoint5 waypoint2)
	(can_traverse rover1 waypoint2 waypoint5)
	(on_board camera0 rover0)
	(calibration_target camera0 objective0)
	(supports camera0 colour)
	(supports camera0 low_res)
	(on_board camera1 rover0)
	(calibration_target camera1 objective1)
	(supports camera1 colour)
	(supports camera1 low_res)
	(on_board camera2 rover1)
	(calibration_target camera2 objective0)
	(supports camera2 colour)
	(supports camera2 high_res)
	(visible_from objective0 waypoint0)
	(visible_from objective0 waypoint1)
	(visible_from objective0 waypoint2)
	(visible_from objective0 waypoint3)
	(visible_from objective0 waypoint4)
	(visible_from objective0 waypoint5)
	(visible_from objective1 waypoint0)
	(visible_from objective1 waypoint1)
)

(:goal (and
(communicated_soil_data waypoint5)
(communicated_soil_data waypoint1)
(communicated_soil_data waypoint4)
(communicated_soil_data waypoint2)
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint2)
(communicated_rock_data waypoint3)
(communicated_image_data objective0 colour)
(communicated_image_data objective1 low_res)
(communicated_image_data objective0 low_res)
	)
)
)

; plan
1. (navigate rover0 waypoint1 waypoint0)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint0)
   goals met: 0 of 10
2. (calibrate rover0 camera1 objective1 waypoint0)
   added: (calibrated camera1 rover0)
   goals met: 0 of 10
3. (sample_rock rover0 rover0store waypoint0)
   deleted: (empty rover0store) (at_rock_sample waypoint0)
   added: (full rover0store) (have_rock_analysis rover0 waypoint0)
   goals met: 0 of 10
4. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 10
5. (take_image rover0 waypoint0 objective0 camera1 colour)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective0 colour)
   goals met: 0 of 10
6. (calibrate rover0 camera1 objective1 waypoint0)
   added: (calibrated camera1 rover0)
   goals met: 0 of 10
7. (take_image rover0 waypoint0 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective1 low_res)
   goals met: 0 of 10
8. (calibrate rover0 camera1 objective1 waypoint0)
   added: (calibrated camera1 rover0)
   goals met: 0 of 10
9. (take_image rover0 waypoint0 objective0 camera1 low_res)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective0 low_res)
   goals met: 0 of 10
10. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (full rover1store) (have_soil_analysis rover1 waypoint4)
   goals met: 0 of 10
11. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 10
12. (communicate_soil_data rover1 general waypoint4 waypoint4 waypoint3)
   deleted: (available rover1) (channel_free general)
   added: (communicated_soil_data waypoint4)
   goals met: 1 of 10
13. (end_communication rover1 general colour waypoint4 waypoint3)
   added: (channel_free general) (available rover1)
   goals met: 1 of 10
14. (navigate rover0 waypoint0 waypoint3)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint3)
   goals met: 1 of 10
15. (sample_rock rover0 rover0store waypoint3)
   deleted: (empty rover0store) (at_rock_sample waypoint3)
   added: (full rover0store) (have_rock_analysis rover0 waypoint3)
   goals met: 1 of 10
16. (navigate rover0 waypoint3 waypoint0)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint0)
   goals met: 1 of 10
17. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 1 of 10
18. (navigate rover0 waypoint0 waypoint2)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint2)
   goals met: 1 of 10
19. (sample_rock rover0 rover0store waypoint2)
   deleted: (empty rover0store) (at_rock_sample waypoint2)
   added: (full rover0store) (have_rock_analysis rover0 waypoint2)
   goals met: 1 of 10
20. (navigate rover1 waypoint4 waypoint1)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint1)
   goals met: 1 of 10
21. (sample_soil rover1 rover1store waypoint1)
   deleted: (empty rover1store) (at_soil_sample waypoint1)
   added: (full rover1store) (have_soil_analysis rover1 waypoint1)
   goals met: 1 of 10
22. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 1 of 10
23. (navigate rover1 waypoint1 waypoint4)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint4)
   goals met: 1 of 10
24. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 1 of 10
25. (sample_soil rover1 rover1store waypoint5)
   deleted: (empty rover1store) (at_soil_sample waypoint5)
   added: (full rover1store) (have_soil_analysis rover1 waypoint5)
   goals met: 1 of 10
26. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 1 of 10
27. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 1 of 10
28. (sample_soil rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_soil_sample waypoint2)
   added: (full rover1store) (have_soil_analysis rover1 waypoint2)
   goals met: 1 of 10
29. (communicate_soil_data rover1 general waypoint5 waypoint2 waypoint3)
   deleted: (available rover1) (channel_free general)
   added: (communicated_soil_data waypoint5)
   goals met: 2 of 10
30. (end_communication rover1 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover1)
   goals met: 2 of 10
31. (communicate_rock_data rover0 general waypoint3 waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_rock_data waypoint3)
   goals met: 3 of 10
32. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 3 of 10
33. (communicate_soil_data rover1 general waypoint2 waypoint2 waypoint3)
   deleted: (available rover1) (channel_free general)
   added: (communicated_soil_data waypoint2)
   goals met: 4 of 10
34. (end_communication rover1 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover1)
   goals met: 4 of 10
35. (communicate_soil_data rover1 general waypoint1 waypoint2 waypoint3)
   deleted: (available rover1) (channel_free general)
   added: (communicated_soil_data waypoint1)
   goals met: 5 of 10
36. (end_communication rover1 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover1)
   goals met: 5 of 10
37. (communicate_rock_data rover0 general waypoint2 waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_rock_data waypoint2)
   goals met: 6 of 10
38. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 6 of 10
39. (communicate_rock_data rover0 general waypoint0 waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_rock_data waypoint0)
   goals met: 7 of 10
40. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 7 of 10
41. (communicate_image_data rover0 general objective1 low_res waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_image_data objective1 low_res)
   goals met: 8 of 10
42. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 8 of 10
43. (communicate_image_data rover0 general objective0 low_res waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_image_data objective0 low_res)
   goals met: 9 of 10
44. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 9 of 10
45. (communicate_image_data rover0 general objective0 colour waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_image_data objective0 colour)
   goals met: 10 of 10
